In [1]:
import pandas as pd

In [17]:
students= pd.read_excel('Students19.xlsx', index_col= 'ID')
#print(students)
temp= students[['Test_1', 'Test_2', 'Test_3']]
row_sum= temp.sum(axis= 1)#设置轴axis=1使横向相加计算和
row_mean= temp.mean(axis= 1)#计算横向平均值
students['Total']= row_sum
students['Average']= row_mean
#print(students)
col_mean= students[['Test_1', 'Test_2', 'Test_3', 'Total', 'Average' ]].mean()
col_mean['Name']= 'Summary'#命名
students= students.append(col_mean, ignore_index=True)#ignore_index=True 设置添加位置
print(students)

           Name  Test_1  Test_2  Test_3  Total    Average
0   Student_001   62.00   86.00    83.0  231.0  77.000000
1   Student_002   77.00   97.00    78.0  252.0  84.000000
2   Student_003   57.00   96.00    46.0  199.0  66.333333
3   Student_004   57.00   87.00    80.0  224.0  74.666667
4   Student_005   95.00   59.00    87.0  241.0  80.333333
5   Student_006   56.00   97.00    61.0  214.0  71.333333
6   Student_007   64.00   91.00    67.0  222.0  74.000000
7   Student_008   96.00   70.00    48.0  214.0  71.333333
8   Student_009   77.00   73.00    48.0  198.0  66.000000
9   Student_010   90.00   94.00    67.0  251.0  83.666667
10  Student_011   62.00   55.00    63.0  180.0  60.000000
11  Student_012   83.00   76.00    81.0  240.0  80.000000
12  Student_013   68.00   60.00    90.0  218.0  72.666667
13  Student_014   82.00   68.00    98.0  248.0  82.666667
14  Student_015   61.00   67.00    91.0  219.0  73.000000
15  Student_016   59.00   63.00    46.0  168.0  56.000000
16  Student_017   62.00   83.00    93.0  238.0  79.333333
17  Student_018   90.00   75.00    80.0  245.0  81.666667
18  Student_019  100.00   95.00    55.0  250.0  83.333333
19  Student_020   61.00   87.00   100.0  248.0  82.666667
20      Summary   72.95   78.95    73.1  225.0  75.000000

In [2]:
students = pd.read_excel('Students19.xlsx', index_col= 'ID')
students.head()

           Name  Test_1  Test_2  Test_3
ID
1   Student_001      62      86      83
2   Student_002      77      97      78
3   Student_003      57      96      46
4   Student_004      57      87      80
5   Student_005      95      59      87

- 总和，平均数

In [11]:
#方法一

In [8]:
temp = students[['Test_1', 'Test_2', 'Test_3']]
row_sum = temp.sum(axis= 1)
row_mean = temp.mean(axis= 1)

In [9]:
students['Total'] = row_sum
students['Average'] = row_mean
students.head()

           Name  Test_1  Test_2  Test_3    Average  Total
ID
1   Student_001      62      86      83  77.000000    231
2   Student_002      77      97      78  84.000000    252
3   Student_003      57      96      46  66.333333    199
4   Student_004      57      87      80  74.666667    224
5   Student_005      95      59      87  80.333333    241

In [12]:
#方法二：

In [10]:
students['total'] = students['Test_1']+ students['Test_2']+ students['Test_3']
students['average'] = students['total']/3
students.head()

           Name  Test_1  Test_2  Test_3    Average  Total  total    average
ID
1   Student_001      62      86      83  77.000000    231    231  77.000000
2   Student_002      77      97      78  84.000000    252    252  84.000000
3   Student_003      57      96      46  66.333333    199    199  66.333333
4   Student_004      57      87      80  74.666667    224    224  74.666667
5   Student_005      95      59      87  80.333333    241    241  80.333333

- 计算各列平均数

In [15]:
col_mean= students[['Test_1', 'Test_2', 'Test_3', 'Total', 'Average','total', 'average' ]].mean()
col_mean['Name'] = 'Summary'
students.append(col_mean)

TypeError: Can only append a Series if ignore_index=True or if the Series has a name

In [16]:
col_mean= students[['Test_1', 'Test_2', 'Test_3', 'Total', 'Average','total', 'average' ]].mean()
col_mean['Name'] = 'Summary'
students.append(col_mean, ignore_index= True)

           Name  Test_1  Test_2  Test_3    Average  Total  total    average
0   Student_001   62.00   86.00    83.0  77.000000  231.0  231.0  77.000000
1   Student_002   77.00   97.00    78.0  84.000000  252.0  252.0  84.000000
2   Student_003   57.00   96.00    46.0  66.333333  199.0  199.0  66.333333
3   Student_004   57.00   87.00    80.0  74.666667  224.0  224.0  74.666667
4   Student_005   95.00   59.00    87.0  80.333333  241.0  241.0  80.333333
5   Student_006   56.00   97.00    61.0  71.333333  214.0  214.0  71.333333
6   Student_007   64.00   91.00    67.0  74.000000  222.0  222.0  74.000000
7   Student_008   96.00   70.00    48.0  71.333333  214.0  214.0  71.333333
8   Student_009   77.00   73.00    48.0  66.000000  198.0  198.0  66.000000
9   Student_010   90.00   94.00    67.0  83.666667  251.0  251.0  83.666667
10  Student_011   62.00   55.00    63.0  60.000000  180.0  180.0  60.000000
11  Student_012   83.00   76.00    81.0  80.000000  240.0  240.0  80.000000
12  Student_013   68.00   60.00    90.0  72.666667  218.0  218.0  72.666667
13  Student_014   82.00   68.00    98.0  82.666667  248.0  248.0  82.666667
14  Student_015   61.00   67.00    91.0  73.000000  219.0  219.0  73.000000
15  Student_016   59.00   63.00    46.0  56.000000  168.0  168.0  56.000000
16  Student_017   62.00   83.00    93.0  79.333333  238.0  238.0  79.333333
17  Student_018   90.00   75.00    80.0  81.666667  245.0  245.0  81.666667
18  Student_019  100.00   95.00    55.0  83.333333  250.0  250.0  83.333333
19  Student_020   61.00   87.00   100.0  82.666667  248.0  248.0  82.666667
20      Summary   72.95   78.95    73.1  75.000000  225.0  225.0  75.000000